
from ShahmMusic import BOT_NAME
from ShahmMusic.Helpers.button_style import DOWNLOAD_TAG, GUITAR_TAG, SMILE_TAG

PM_START_TEXT = f"""𝗦𝗼𝗨𝗥𝗖𝗲\n\n✧ ¦ مـرحـبا بـك يـا مــعـلـم {SMILE_TAG}\n✧ ¦ اولا كده انا بشغل اغاني في الكول {GUITAR_TAG}\n✧ ¦ بـنزل اغاني و فيديوهات بردو يــســطا {DOWNLOAD_TAG}\n✧ ¦ اضغـط علي زر اوامـر البـوت\n𝗦𝗼𝗨𝗥𝗖𝗲 " """

START_TEXT = """
**- [ᯓ 「𝗦𝗼𝗨𝗥𝗖𝗲  」، ⦃𓏛](t.me/VGISV)
—————————————
- [cσffєє™ 𝓼](t.me/KOK0KK)

- [ᔆ ᴾ ᴱ ᴱ ᴰ ™𝓼](https://t.me/l_s_I_I)**

- [ɢ ɴ ᴀ ᴢ ʜ ™ 𝓼](t.me/GNA_I)
"""

HELP_TEXT = f"""
<u> **الاوامر في بوت ميوزك {BOT_NAME} :**</u>

**♚ مرحبا بك في اوامر التشغيل ♡**

**• اوامر التشغيل البـوت**

**›› تشغيل ↫ لتشغيل اغنية**
**›› تخطي ↫ لتخطي التشغيل الحالي**
**›› ايقاف ↫ لانتهاء التشغيل الحالي**
**›› اسكت ↫ لايقاف التشغيل الحالي مؤقتا**
**›› كمل ↫ لاستمرار التشغيل المتوقف**
**›› بحث او فيديو ↫لتحميـل الاغانـي اڪتب**

**›› اكتب بنك لمعرفة سرعة تشغيل البوت **
**›› اكتب المطورين لمعرفة مطورين البوت**
**›› اكتب تحميل + الاسم للتنزيل من اليوتيوب**

𝗦𝗼𝗨𝗥𝗖𝗲 cσffєє™ 𝓼  ‌♬⁩ : @KOK0KK
"""

HELP_SUDO = f"""
<u> **اوامر المطور {BOT_NAME} :**</u>

**›› اكتب المكالمات لمعرفة المكالمات في البوت**
**›› اكتب /eval لتشغيل على محطة البوت **
**›› اكتب فحص لاختبار سرعة السيرفر  **
**›› اكتب الاحصائيات لعرض إحصائيات السيرفر **

**›› اكتب اسم + الاسم لوضعة اسم للمساعد**
**›› اكتب بايو + البايو لوضعة بايو للمساعد**
**›› اكتب صورة واعمل رد على صورة للمساعد**
**›› اكتب مسح لحذف صورة الحساب المساعد **

𝑆𝑂𝑈𝑅𝐶𝐸 cσffєє™ 𝓼 ‌♬⁩ : @KOK0KK
"""

HELP_DEV = f"""
<u> **اوامر المالك {BOT_NAME} :**</u>

**›› هذا الاوامر فقط لمطور البوت **

**›› اكتب اذاعة و اعمل رد على الاذاعه**
**›› اكتب تنظيف لمسح التخزين المؤقت للبوت**
**›› اكتب مغادرة لمغادرة المساعد الكروبات**

**›› اكتب مطور +اليوزر لإضافة مطور في البوت**
**›› اكتب تنزيل +اليوزر لـتـنزيل مطور من البوت**

𝑆𝑂𝑈𝑅𝐶𝐸 ᔆ ᴾ ᴱ ᴱ ᴰ ™𝓼 ‌♬⁩ : @l_s_I_I
"""
